Revit 2024 API
Document.PanelTypes Property
Retrieves a set of PanelType objects that contains all the panel types that are currently loaded into the project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public PanelTypeSet PanelTypes { get; }
Visual Basic
Public ReadOnly Property PanelTypes As PanelTypeSet
	Get
Visual C++
public:
property PanelTypeSet^ PanelTypes {
	PanelTypeSet^ get ();
}
Remarks
This property returns a set of panelType objects. These objects can be used change the type of a panel from one type to another.
See Also
Document Class
Autodesk.Revit.DB Namespace